<h3 class='page-title'>
    Про проект
</h3>

<div class="page-body">
    <article>
        <p><b>Дані у файлі представлені у вигляді об'єкта:</b></p>
        <code type='json'>
            <pre>
                {
                    "lastUpdate": 1451286316468,
                    "r1": {
                        "oldAreaName": "Кіровський",
                        "newAreaName": "Фортечний",
                        "objects": [
                            {
                                "type": "street", 
                                "newType": "avenue", 
                                "oldName": "50 років Жовтня",
                                "newName": "Соборна",
                                "restored": true,
                                "link": {
                                    "href": "https://uk.wikipedia.org/.....",
                                    "type": 2
                                }
                            },
                        ...
                        ]
                    },
                    "r1": {
                    ...
                    }
                }
            </pre>
        </code>
        <p>Поля районів представлені ключами виду r1, r2 - таким чином кодуються райони в державних статистичних реєстрах виконавчої влади. Нумерація алфавітна , це означає , що 1 - это Кіровський, 2 - Ленінський. Однак , у зв'язку зі зміною назв районів змінився і їх алфавітний порядок . Але ! <strong>Я більш ніж упевнений , що в органах усталений порядок міняти не будуть !</strong> Швидше за все , нумерація залишиться старою , поміняють тільки назви . Зважаючи на це я залишив такі поля для сумісності з базами органів виконавчої влади .</p>
        <p>Також в корені об'єкта є поле <span class="data-text">lastUpdate</span> яке містить тимчасову мітку дати останнього оновлення файлу даних ( ціле число ).</p>
        <p>Кожен район - це об'єкт з обов'язковими полями: <span class="data-text">oldAreaName</span> - стара назва району, <span class="data-text">newAreaName</span> -нова назва району, <span class="data-text">objects</span> - массив географічних обьектів, які зазнали перейменування.</p>
        <p>Кожен об'єкт перейменування має обов'язкові поля: <span class="data-text">type</span> - тип объекта (перечень ниже), <span class="data-text">oldName</span> - стара назва объекта, <span class="data-text">newName</span> - нова назва объекта, а також набір необов'язкових полів , таких як  <span class="data-text">newType</span>, <span class="data-text">restored</span>, <span class="data-text">link</span>.</p>
        <p>Поле <span class="data-text">link</span> описує посилання на суб'єкта перейменування поточного об'єкта ( інакше кажучи , в честь кого або чого зроблено перейменування конкретної вулиці чи місця ) . Це поле , в сою чергу має два обов'язкових поля: <span class="data-text">href</span> - посилання на джерело з інформацією про суб'єкта і <span class="data-text">type</span> - тип суб'єкта , це ціле число , значення якого відповідає:<br>
            <span class="data-text">1</span> - конкретна особистість<br>
            <span class="data-text">3</span> - певну історичну подію<br>
            <span class="data-text">2</span> - географічний об'єкт<br>
            <span class="data-text">4</span> - деяка організація або співтовариство , наприклад - сім'я<br>
        </p>
        <p>Пряме посилання на API з даними в форматі JSON: <a href="api/v1/streets">завантажити...</a></p>
    </article>
</div>